{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen/Qwen2.5-VL-7B-Instruct",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "lm_head"
  ],
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {
    "^layers\\.\\d+\\.mlp\\.": 32,
    "^layers\\.\\d+\\.self_attn": 64,
    "^visual\\.": 16
  },
  "revision": null,
  "target_modules": "(?:visual\\.blocks\\.\\d+\\.(?:attn\\.(?:qkv|proj)|mlp\\.(?:gate_proj|up_proj|down_proj))|layers\\.\\d+\\.(?:self_attn\\.(?:q_proj|k_proj|v_proj|o_proj)|mlp\\.(?:gate_proj|up_proj|down_proj)))$",
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}
